7767517
6 6
Input                    in0                      0 1 in0
Embed                    embed_1                  1 1 in0 1 0=320 1=7341 2=0 3=2349120
Permute                  permute_2                1 1 1 2 0=1
ConvolutionDepthWise1D   convdw1d_4               1 1 2 3 0=320 1=2 2=1 3=1 4=0 5=0 6=640 7=320
Permute                  permute_3                1 1 3 4 0=1
ReLU                     relu_0                   1 1 4 out0
