7767517
192 267
SherpaMetaData           sherpa_meta_data1        0 0 0=3 1=8 2=144 3=320
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Input                    in2                      0 1 in2
Split                    splitncnn_0              1 8 in2 3 4 5 6 7 8 9 10
Input                    in3                      0 1 in3
Split                    splitncnn_1              1 8 in3 12 13 14 15 16 17 18 19
ExpandDims               unsqueeze_68             1 1 in0 20 -23303=1,0
Convolution              conv_11                  1 1 20 21 0=8 1=3 11=3 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=72
Split                    splitncnn_2              1 2 21 22 23
BinaryOp                 sub_0                    1 1 22 24 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_0                1 1 24 25
BinaryOp                 mul_1                    2 1 23 25 26 0=2
Convolution              conv_12                  1 1 26 27 0=32 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=2304
Split                    splitncnn_3              1 2 27 28 29
BinaryOp                 sub_2                    1 1 28 30 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_1                1 1 30 31
BinaryOp                 mul_3                    2 1 29 31 32 0=2
Convolution              conv_13                  1 1 32 33 0=128 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=36864
Split                    splitncnn_4              1 2 33 34 35
BinaryOp                 sub_4                    1 1 34 36 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_2                1 1 36 37
BinaryOp                 mul_5                    2 1 35 37 38 0=2
Permute                  permute_65               1 1 38 39 0=2
Reshape                  reshape_39               1 1 39 40 0=2304 1=-1
InnerProduct             linear_14                1 1 40 41 0=144 1=1 2=331776
Split                    splitncnn_5              1 3 41 42 43 44
BinaryOp                 mul_6                    2 1 42 43 45 0=2
Reduction                mean_56                  1 1 45 46 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_7                    1 1 46 47 0=0 1=1 2=2.499996e-01
BinaryOp                 pow_8                    1 1 47 48 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_9                    2 1 44 48 49 0=2
BinaryOp                 sub_10                   1 1 in1 50 0=1 1=1 2=3.000000e+00
BinaryOp                 div_11                   1 1 50 51 0=3 1=1 2=2.000000e+00
UnaryOp                  floor_12                 1 1 51 52 0=2
BinaryOp                 sub_13                   1 1 52 53 0=1 1=1 2=1.000000e+00
BinaryOp                 div_14                   1 1 53 54 0=3 1=1 2=2.000000e+00
UnaryOp                  floor_15                 1 1 54 out1 0=2
Crop                     slice_41                 1 1 19 56 -23310=1,1 -23311=1,0 -23309=1,0
Crop                     slice_40                 1 1 10 57 -23310=1,1 -23311=1,0 -23309=1,0
Split                    splitncnn_6              1 2 49 58 59
LSTM                     lstm_31                  3 3 59 57 56 60 61 62 0=144 1=184320 2=0 3=320
BinaryOp                 add_16                   2 1 60 58 63 0=0
Split                    splitncnn_7              1 2 63 64 65
InnerProduct             linear_15                1 1 65 66 0=576 1=1 2=82944
Split                    splitncnn_8              1 2 66 67 68
BinaryOp                 sub_17                   1 1 67 69 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_3                1 1 69 70
BinaryOp                 mul_18                   2 1 68 70 71 0=2
InnerProduct             linear_16                1 1 71 72 0=144 1=1 2=82944
BinaryOp                 add_19                   2 1 64 72 73 0=0
Split                    splitncnn_9              1 3 73 74 75 76
BinaryOp                 mul_20                   2 1 74 75 77 0=2
Reduction                mean_57                  1 1 77 78 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_21                   1 1 78 79 0=0 1=1 2=1.105032e+00
BinaryOp                 pow_22                   1 1 79 80 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_23                   2 1 76 80 81 0=2
Split                    splitncnn_10             1 2 81 82 83
Crop                     slice_43                 1 1 18 84 -23310=1,2 -23311=1,0 -23309=1,1
Crop                     slice_42                 1 1 9 85 -23310=1,2 -23311=1,0 -23309=1,1
LSTM                     lstm_32                  3 3 83 85 84 86 87 88 0=144 1=184320 2=0 3=320
BinaryOp                 add_24                   2 1 86 82 89 0=0
Split                    splitncnn_11             1 2 89 90 91
InnerProduct             linear_17                1 1 91 92 0=576 1=1 2=82944
Split                    splitncnn_12             1 2 92 93 94
BinaryOp                 sub_25                   1 1 93 95 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_4                1 1 95 96
BinaryOp                 mul_26                   2 1 94 96 97 0=2
InnerProduct             linear_18                1 1 97 98 0=144 1=1 2=82944
BinaryOp                 add_27                   2 1 90 98 99 0=0
Split                    splitncnn_13             1 3 99 100 101 102
BinaryOp                 mul_28                   2 1 100 101 103 0=2
Reduction                mean_58                  1 1 103 104 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_29                   1 1 104 105 0=0 1=1 2=1.442142e+00
BinaryOp                 pow_30                   1 1 105 106 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_31                   2 1 102 106 107 0=2
Split                    splitncnn_14             1 2 107 108 109
Crop                     slice_45                 1 1 17 110 -23310=1,3 -23311=1,0 -23309=1,2
Crop                     slice_44                 1 1 8 111 -23310=1,3 -23311=1,0 -23309=1,2
LSTM                     lstm_33                  3 3 109 111 110 112 113 114 0=144 1=184320 2=0 3=320
BinaryOp                 add_32                   2 1 112 108 115 0=0
Split                    splitncnn_15             1 2 115 116 117
InnerProduct             linear_19                1 1 117 118 0=576 1=1 2=82944
Split                    splitncnn_16             1 2 118 119 120
BinaryOp                 sub_33                   1 1 119 121 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_5                1 1 121 122
BinaryOp                 mul_34                   2 1 120 122 123 0=2
InnerProduct             linear_20                1 1 123 124 0=144 1=1 2=82944
BinaryOp                 add_35                   2 1 116 124 125 0=0
Split                    splitncnn_17             1 3 125 126 127 128
BinaryOp                 mul_36                   2 1 126 127 129 0=2
Reduction                mean_59                  1 1 129 130 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_37                   1 1 130 131 0=0 1=1 2=1.642824e+00
BinaryOp                 pow_38                   1 1 131 132 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_39                   2 1 128 132 133 0=2
Split                    splitncnn_18             1 2 133 134 135
Crop                     slice_47                 1 1 16 136 -23310=1,4 -23311=1,0 -23309=1,3
Crop                     slice_46                 1 1 7 137 -23310=1,4 -23311=1,0 -23309=1,3
LSTM                     lstm_34                  3 3 135 137 136 138 139 140 0=144 1=184320 2=0 3=320
BinaryOp                 add_40                   2 1 138 134 141 0=0
Split                    splitncnn_19             1 2 141 142 143
InnerProduct             linear_21                1 1 143 144 0=576 1=1 2=82944
Split                    splitncnn_20             1 2 144 145 146
BinaryOp                 sub_41                   1 1 145 147 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_6                1 1 147 148
BinaryOp                 mul_42                   2 1 146 148 149 0=2
InnerProduct             linear_22                1 1 149 150 0=144 1=1 2=82944
BinaryOp                 add_43                   2 1 142 150 151 0=0
Split                    splitncnn_21             1 3 151 152 153 154
BinaryOp                 mul_44                   2 1 152 153 155 0=2
Reduction                mean_60                  1 1 155 156 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_45                   1 1 156 157 0=0 1=1 2=1.845561e+00
BinaryOp                 pow_46                   1 1 157 158 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_47                   2 1 154 158 159 0=2
Split                    splitncnn_22             1 2 159 160 161
Crop                     slice_49                 1 1 15 162 -23310=1,5 -23311=1,0 -23309=1,4
Crop                     slice_48                 1 1 6 163 -23310=1,5 -23311=1,0 -23309=1,4
LSTM                     lstm_35                  3 3 161 163 162 164 165 166 0=144 1=184320 2=0 3=320
BinaryOp                 add_48                   2 1 164 160 167 0=0
Split                    splitncnn_23             1 2 167 168 169
InnerProduct             linear_23                1 1 169 170 0=576 1=1 2=82944
Split                    splitncnn_24             1 2 170 171 172
BinaryOp                 sub_49                   1 1 171 173 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_7                1 1 173 174
BinaryOp                 mul_50                   2 1 172 174 175 0=2
InnerProduct             linear_24                1 1 175 176 0=144 1=1 2=82944
BinaryOp                 add_51                   2 1 168 176 177 0=0
Split                    splitncnn_25             1 3 177 178 179 180
BinaryOp                 mul_52                   2 1 178 179 181 0=2
Reduction                mean_61                  1 1 181 182 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_53                   1 1 182 183 0=0 1=1 2=1.843497e+00
BinaryOp                 pow_54                   1 1 183 184 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_55                   2 1 180 184 185 0=2
Split                    splitncnn_26             1 2 185 186 187
Crop                     slice_51                 1 1 14 188 -23310=1,6 -23311=1,0 -23309=1,5
Crop                     slice_50                 1 1 5 189 -23310=1,6 -23311=1,0 -23309=1,5
LSTM                     lstm_36                  3 3 187 189 188 190 191 192 0=144 1=184320 2=0 3=320
BinaryOp                 add_56                   2 1 190 186 193 0=0
Split                    splitncnn_27             1 2 193 194 195
InnerProduct             linear_25                1 1 195 196 0=576 1=1 2=82944
Split                    splitncnn_28             1 2 196 197 198
BinaryOp                 sub_57                   1 1 197 199 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_8                1 1 199 200
BinaryOp                 mul_58                   2 1 198 200 201 0=2
InnerProduct             linear_26                1 1 201 202 0=144 1=1 2=82944
BinaryOp                 add_59                   2 1 194 202 203 0=0
Split                    splitncnn_29             1 3 203 204 205 206
BinaryOp                 mul_60                   2 1 204 205 207 0=2
Reduction                mean_62                  1 1 207 208 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_61                   1 1 208 209 0=0 1=1 2=1.311211e+00
BinaryOp                 pow_62                   1 1 209 210 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_63                   2 1 206 210 211 0=2
Split                    splitncnn_30             1 2 211 212 213
Crop                     slice_53                 1 1 13 214 -23310=1,7 -23311=1,0 -23309=1,6
Crop                     slice_52                 1 1 4 215 -23310=1,7 -23311=1,0 -23309=1,6
LSTM                     lstm_37                  3 3 213 215 214 216 217 218 0=144 1=184320 2=0 3=320
BinaryOp                 add_64                   2 1 216 212 219 0=0
Split                    splitncnn_31             1 2 219 220 221
InnerProduct             linear_27                1 1 221 222 0=576 1=1 2=82944
Split                    splitncnn_32             1 2 222 223 224
BinaryOp                 sub_65                   1 1 223 225 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_9                1 1 225 226
BinaryOp                 mul_66                   2 1 224 226 227 0=2
InnerProduct             linear_28                1 1 227 228 0=144 1=1 2=82944
BinaryOp                 add_67                   2 1 220 228 229 0=0
Split                    splitncnn_33             1 3 229 230 231 232
BinaryOp                 mul_68                   2 1 230 231 233 0=2
Reduction                mean_63                  1 1 233 234 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_69                   1 1 234 235 0=0 1=1 2=6.328920e-01
BinaryOp                 pow_70                   1 1 235 236 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_71                   2 1 232 236 237 0=2
Split                    splitncnn_34             1 2 237 238 239
Crop                     slice_55                 1 1 12 240 -23310=1,8 -23311=1,0 -23309=1,7
Crop                     slice_54                 1 1 3 241 -23310=1,8 -23311=1,0 -23309=1,7
LSTM                     lstm_38                  3 3 239 241 240 242 243 244 0=144 1=184320 2=0 3=320
BinaryOp                 add_72                   2 1 242 238 245 0=0
Split                    splitncnn_35             1 2 245 246 247
InnerProduct             linear_29                1 1 247 248 0=576 1=1 2=82944
Split                    splitncnn_36             1 2 248 249 250
BinaryOp                 sub_73                   1 1 249 251 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_10               1 1 251 252
BinaryOp                 mul_74                   2 1 250 252 253 0=2
InnerProduct             linear_30                1 1 253 254 0=144 1=1 2=82944
BinaryOp                 add_75                   2 1 246 254 255 0=0
Split                    splitncnn_37             1 3 255 256 257 258
BinaryOp                 mul_76                   2 1 256 257 259 0=2
Reduction                mean_64                  1 1 259 260 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_77                   1 1 260 261 0=0 1=1 2=3.666728e-01
BinaryOp                 pow_78                   1 1 261 262 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_79                   2 1 258 262 out0 0=2
Concat                   cat_0                    8 1 62 88 114 140 166 192 218 244 out3 0=0
Concat                   cat_1                    8 1 61 87 113 139 165 191 217 243 out2 0=0
